Reports/КонтрольБеременности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>КонтрольБеременности</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровHTML</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиПланаВеденияБеременности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиПланаВеденияБеременности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДляОтображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОсмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Гравидограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Гравидограммы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрHTML</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбсолютныйМинимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбсолютныйМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПределыЗначенияВРазрезеСроков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СрокВНеделях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/КонтрольБеременности/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокГравидограмм();
	ТабДокПлан.АвтоМасштаб = Истина;
	ТабДокГравидограммы.АвтоМасштаб = Истина;
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;
		ЗаполнитьДатыНачалаБеременности();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройкиГравидограмм();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Если ПроверитьЗаполнение() Тогда
		ЗаполнитьПлан();
		ВывестиГрвидограммы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПланГравидогрвммы(Команда)

	ТабДок = ПолучитьТабДокПланГравидограммы(ТабДокПлан, ТабДокГравидограммы);
	
	СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДок,,,Строка(Клиент));	
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,Клиент);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьГравидограммы(Команда)

	ТабДок = ПолучитьТабДокГравидограммы(ТабДокГравидограммы);
	
	СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДок,,,Строка(Клиент));	
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,Клиент);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПлан(Команда)
	
	ТабДок = ПолучитьТабДокПлан(ТабДокПлан);
	
	СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДок,,,Строка(Клиент));	
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,Клиент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ЗаполнитьДатыНачалаБеременности();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОчиститьТабличныеДокументыФормы(ТабДокГравидограммы, ТабДокПлан);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДатыНачалаБеременности()
	
	ТабДокГравидограммы.Очистить();
	ТабДокПлан.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прием.Ссылка КАК Ссылка,
	               |	Прием.Дата КАК Дата
	               |ПОМЕСТИТЬ Приемы
	               |ИЗ
	               |	Документ.Прием КАК Прием
	               |ГДЕ
	               |	Прием.Клиент = &Клиент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Приемы.Ссылка КАК Ссылка,
	               |	ЗначенияПараметровHTML.Параметр КАК Параметр,
	               |	ЗначенияПараметровHTML.Значение КАК Значение,
	               |	Приемы.Дата КАК Дата
	               |ИЗ
	               |	Приемы КАК Приемы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	               |		ПО Приемы.Ссылка = ЗначенияПараметровHTML.Документ
	               |			И (ЗначенияПараметровHTML.Параметр = &Параметр)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
				   
	Запрос.УстановитьПараметр("Параметр", ПланыВидовХарактеристик.ПараметрыHTML.НомерНеделиБеременности);
	Запрос.УстановитьПараметр("Клиент", Клиент);

	ВыборкаДЗ = Запрос.Выполнить().Выбрать();
	Элементы.ДатаНачала.СписокВыбора.Очистить();
	Пока ВыборкаДЗ.Следующий() Цикл
		ДатаНачалаБеременности = НачалоДня(ВыборкаДЗ.Дата) - ВыборкаДЗ.Значение * 7 * 24 * 60 * 60;
		Добавлять = Истина;
		Для Каждого стр Из Элементы.ДатаНачала.СписокВыбора Цикл
			Если (стр.Значение - ДатаНачалаБеременности) / 86400 < 30 Тогда
				Добавлять = Ложь;	
			КонецЕсли;
		КонецЦикла;
		Если Добавлять Тогда
			Элементы.ДатаНачала.СписокВыбора.Добавить(ДатаНачалаБеременности, Формат(ДатаНачалаБеременности, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЦикла;
	
	Если Элементы.ДатаНачала.СписокВыбора.Количество() = 1 Тогда
		ДатаНачала = Элементы.ДатаНачала.СписокВыбора.Получить(0).Значение;
		Если ПроверитьЗаполнение() Тогда
			ЗаполнитьПлан();
			ВывестиГрвидограммы();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьТабличныеДокументыФормы(ТабДокГравидограммы, ТабДокПлан)
	ТабДокГравидограммы.Очистить();
	ТабДокПлан.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлан()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокПлан.Очистить();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.КонтрольБеременности.ПолучитьМакет("План");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Клиент = Клиент.Фамилия + " " + Клиент.Имя + " " + Клиент.Отчество;
	ОбластьШапка.Параметры.Дата = Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Приемы.Ссылка,
	|   Приемы.Дата
	|ПОМЕСТИТЬ Приемы
	|ИЗ
	|	Документ.Прием КАК Приемы
	|ГДЕ
	|	Приемы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Приемы.Клиент = &Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЧастьШаблоныПриема.ШаблонПриема КАК ШаблонПриема,
	|	Приемы.Дата КАК Дата
	|ПОМЕСТИТЬ ПриемыСОтборомПоШаблону
	|ИЗ
	|	Приемы КАК Приемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием.ШаблоныПриема КАК ТабЧастьШаблоныПриема
	|		ПО Приемы.Ссылка = ТабЧастьШаблоныПриема.Ссылка
	|ГДЕ
	|	ТабЧастьШаблоныПриема.ШаблонПриема В
	|			(ВЫБРАТЬ
	|				ПланБеременности.ШаблонОсмотра
	|			ИЗ
	|				Справочник.НастройкиПланаВеденияБеременности КАК ПланБеременности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиПланаВеденияБеременности.НомерДляОтображения,
	|	НастройкиПланаВеденияБеременности.Наименование,
	|	СУММА(ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(&ДатаНачала, ПриемыСОтборомПоШаблону.Дата, ДЕНЬ) <= 98
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПервыйТриместр,
	|	СУММА(ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(&ДатаНачала, ПриемыСОтборомПоШаблону.Дата, ДЕНЬ) > 98
	|					И РАЗНОСТЬДАТ(&ДатаНачала, ПриемыСОтборомПоШаблону.Дата, ДЕНЬ) <= 182
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВторойТриместр,
	|	СУММА(ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(&ДатаНачала, ПриемыСОтборомПоШаблону.Дата, ДЕНЬ) > 182
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТретийТриместр,
	|	НастройкиПланаВеденияБеременности.Ссылка
	|ИЗ
	|	ПриемыСОтборомПоШаблону КАК ПриемыСОтборомПоШаблону
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиПланаВеденияБеременности КАК НастройкиПланаВеденияБеременности
	|		ПО ПриемыСОтборомПоШаблону.ШаблонПриема = НастройкиПланаВеденияБеременности.ШаблонОсмотра
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиПланаВеденияБеременности.НомерДляОтображения,
	|	НастройкиПланаВеденияБеременности.Наименование,
	|	НастройкиПланаВеденияБеременности.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиПланаВеденияБеременности.Ссылка";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаНачала + 50 * 7 * 24 * 60 * 60);
	
	ТаблицаПоТриместрам = Запрос.Выполнить().Выгрузить();
	Выборка = Справочники.НастройкиПланаВеденияБеременности.Выбрать(Справочники.НастройкиПланаВеденияБеременности.ПустаяСсылка(),,,"Код");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПланПоДочернимОбъектам(ОбластьСтрока,ТаблицаПоТриместрам, Выборка.Ссылка, ТабДок)
	КонецЦикла;
	
	ТабДокПлан.Вывести(ТабДок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланПоДочернимОбъектам(ОбластьСтрока, ТаблицаПоТриместрам, Родитель, ТабДок)
	
	ОбластьСтрока.Параметры.Номер = Родитель.НомерДляОтображения;
	ОбластьСтрока.Параметры.Наименование = Родитель.Наименование;
	МассивРез = ТаблицаПоТриместрам.НайтиСтроки(Новый Структура("Ссылка",Родитель));
	Если МассивРез.Количество() <> 0 Тогда
		ОбластьСтрока.Параметры.ПервыйТриместр = МассивРез[0].ПервыйТриместр;
		ОбластьСтрока.Параметры.ВторойТриместр = МассивРез[0].ВторойТриместр;
		ОбластьСтрока.Параметры.ТретийТриместр = МассивРез[0].ТретийТриместр;
	Иначе
		ОбластьСтрока.Параметры.ПервыйТриместр = 0;
		ОбластьСтрока.Параметры.ВторойТриместр = 0;
		ОбластьСтрока.Параметры.ТретийТриместр = 0;
	КонецЕсли;
	ТабДок.Вывести(ОбластьСтрока);
	
	Выборка = Справочники.НастройкиПланаВеденияБеременности.Выбрать(Родитель,,,"Код");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПланПоДочернимОбъектам(ОбластьСтрока,ТаблицаПоТриместрам, Выборка.Ссылка, ТабДок)
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокГравидограмм()
	Выборка = Справочники.Гравидограммы.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Строка = Гравидограммы.Добавить();
		Строка.Гравидограмма = Выборка.Ссылка;
		Значение = ХранилищеОбщихНастроек.Загрузить("Гравидограммы",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Если Значение <> Неопределено И Значение = 1 Тогда
			Строка.Показывать = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиГравидограмм()
	Для Каждого стр Из Гравидограммы Цикл 
		Значение = ?(стр.Показывать,1,0);
		ХранилищеОбщихНастроек.Сохранить("Гравидограммы", Строка(стр.Гравидограмма.УникальныйИдентификатор()), Значение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВывестиГрвидограммы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрНомерНедели = ПланыВидовХарактеристик.ПараметрыHTML.НомерНеделиБеременности;
	
	Таблица.Очистить();
	ТабДокГравидограммы.Очистить();
	
	ПараметрыHTML = Новый Массив;
	ПараметрыHTML.Добавить(ПланыВидовХарактеристик.ПараметрыHTML.НомерНеделиБеременности);	
	Для Каждого стр Из Гравидограммы Цикл
		Если стр.Показывать Тогда
			ПараметрыHTML.Добавить(стр.Гравидограмма.ПараметрHTML);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прием.Ссылка КАК Ссылка,
	|	Прием.Дата КАК Дата
	|ПОМЕСТИТЬ Приемы
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Прием.Клиент = &Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Приемы.Ссылка КАК Прием,
	|	ЗначенияПараметровHTML.Параметр КАК Параметр,
	|	ЗначенияПараметровHTML.Значение КАК Значение,
	|	Приемы.Дата КАК Дата
	|ПОМЕСТИТЬ ПриемыСПараметрами
	|ИЗ
	|	Приемы КАК Приемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	|		ПО Приемы.Ссылка = ЗначенияПараметровHTML.Документ
	|ГДЕ
	|	ЗначенияПараметровHTML.Параметр В(&Параметры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемыСПараметрами.Прием КАК Прием,
	|	ПриемыСПараметрами.Параметр КАК Параметр,
	|	ПриемыСПараметрами.Значение КАК Значение,
	|	Гравидограммы.НаименованиеДляПечати КАК НаименованиеДляПечати,
	|	Гравидограммы.АбсолютныйМинимум КАК АбсолютныйМинимум,
	|	Гравидограммы.АбсолютныйМаксимум КАК АбсолютныйМаксимум,
	|	ПриемыСПараметрами.Дата КАК Дата
	|ИЗ
	|	ПриемыСПараметрами КАК ПриемыСПараметрами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Гравидограммы КАК Гравидограммы
	|		ПО ПриемыСПараметрами.Параметр = Гравидограммы.ПараметрHTML";	
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаНачала + 50 * 7 * 24 * 60 * 60);
	Запрос.УстановитьПараметр("Параметры", ПараметрыHTML);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекДокумент = Неопределено;
	Неделя = Неопределено;
	ЗначенияПараметров = Новый  Массив;
	
	НомераНедельДокументов = Новый Соответствие;
	Пока Выборка.НайтиСледующий(Новый Структура("Параметр", ПараметрНомерНедели)) Цикл
		НомераНедельДокументов.Вставить(Выборка.Прием, Выборка.Значение);
	КонецЦикла;
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Параметр = ПараметрНомерНедели Тогда
			Продолжить; // Уже взяли от этих строк что хотели.
		КонецЕсли;
		
		Неделя = НомераНедельДокументов.Получить(Выборка.Прием);
		Если Неделя = Неопределено Тогда
			// Просто считаем , сколько прошло времени от даты начала беременности до даты этого приема. 
			Неделя = 1 + Цел((Выборка.Дата - ДатаНачала) / (86400 * 7));
		КонецЕсли;
		
		Строка = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.Неделя = Неделя;
	КонецЦикла;
	
	Таблица.Сортировать("Параметр Возр, Неделя Возр");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Параметры", ПараметрыHTML);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГравидограммыПределыЗначенияВРазрезеСроков.СрокВНеделях КАК СрокВНеделях,
	               |	ГравидограммыПределыЗначенияВРазрезеСроков.МинимальноеЗначение,
	               |	ГравидограммыПределыЗначенияВРазрезеСроков.МаксимальноеЗначение,
	               |	ГравидограммыПределыЗначенияВРазрезеСроков.Ссылка.ПараметрHTML КАК ПараметрHTML
	               |ИЗ
	               |	Справочник.Гравидограммы.ПределыЗначенияВРазрезеСроков КАК ГравидограммыПределыЗначенияВРазрезеСроков
	               |ГДЕ
	               |	ГравидограммыПределыЗначенияВРазрезеСроков.Ссылка.ПараметрHTML В(&Параметры)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПараметрHTML,
	               |	СрокВНеделях";
				   
				   
	ТаблицаМинМакс = Запрос.Выполнить().Выгрузить();
	
	Макет = Отчеты.КонтрольБеременности.ПолучитьМакет("Гравидограммы");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Клиент = Клиент.Фамилия + " " + Клиент.Имя + " " + Клиент.Отчество;
	ОбластьШапка.Параметры.Дата = Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
	ТабДокГравидограммы.Вывести(ОбластьШапка);
		
	ПрошлыйПараметр = Неопределено;

	Для Каждого СтрТаблица Из Таблица Цикл
		
		Если ПрошлыйПараметр <> СтрТаблица.Параметр Тогда
			
			ОбластьДиаграмма = Макет.ПолучитьОбласть("Диаграмма");
			ОбластьДиаграмма.Параметры.Наименование = СтрТаблица.НаименованиеДляПечати;
			Диаграмма = ОбластьДиаграмма.Рисунки.Гравидограмма.Объект;
			Диаграмма.ТипДиаграммы = ТипДиаграммы.График;
			Диаграмма.ОтображатьЗаголовок = Ложь;
			
			Если СтрТаблица.АМинимум <> 0 Тогда 
				Диаграмма.АвтоМинимальноеЗначение = Ложь;
				Диаграмма.БазовоеЗначение  = СтрТаблица.АМинимум * 0.95;
				Диаграмма.МинимальноеЗначение = СтрТаблица.АМинимум * 0.95;
			КонецЕсли;
			
			Если СтрТаблица.АМаксимум <> 0 Тогда 
				Диаграмма.АвтоМаксимальноеЗначение = Ложь;
				Диаграмма.МаксимальноеЗначение = СтрТаблица.АМаксимум;
			КонецЕсли;
			
			Массив = Таблица.НайтиСтроки(Новый Структура("Параметр", СтрТаблица.Параметр));
			
			Для Нед = СтрТаблица.Неделя По Массив.Получить(Массив.Количество()-1).Неделя Цикл
				Точка = Диаграмма.Точки.Добавить(Строка(Нед));
			КонецЦикла; 
			
			Серия = Диаграмма.Серии.Добавить(СтрТаблица.НаименованиеДляПечати);
			СерияМин = Диаграмма.Серии.Добавить("Минимум");
			СерияМакс = Диаграмма.Серии.Добавить("Максимум");
			
			ПоследнийИндекс = 0;
			ПоследнийИндексММ = 0;

			ПоследнееЗначение = Неопределено;
			
			Для Каждого Точка Из Диаграмма.Точки Цикл
				
				НеделяБеременности = Число(Точка.Текст);
				
				МассивРез = Таблица.НайтиСтроки(Новый Структура("Параметр, Неделя", СтрТаблица.Параметр, НеделяБеременности));

				Если МассивРез.Количество() <> 0 Тогда
					Если ПоследнийИндекс + 2 < Число(Точка.Текст) Тогда
						
						Для ТекИндекс = ПоследнийИндекс + 1 По Диаграмма.Точки.Индекс(Точка) - 1 Цикл
							Диаграмма.УстановитьЗначение(Диаграмма.Точки.Получить(ТекИндекс), Серия, ПоследнееЗначение +((Число(МассивРез[0].Значение)-ПоследнееЗначение)/(Диаграмма.Точки.Индекс(Точка)-ПоследнийИндекс))*(ТекИндекс-ПоследнийИндекс));
						КонецЦикла;
						
					КонецЕсли;
					Попытка
						Диаграмма.УстановитьЗначение(Точка, Серия, Число(МассивРез[0].Значение));
						ПоследнийИндекс = Диаграмма.Точки.Индекс(Точка);
						ПоследнееЗначение = Число(МассивРез[0].Значение);
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				МассивРез = ТаблицаМинМакс.НайтиСтроки(Новый Структура("ПараметрHTML, СрокВНеделях", СтрТаблица.Параметр, НеделяБеременности));
				Если МассивРез.Количество() <> 0 Тогда
					Диаграмма.УстановитьЗначение(Точка, СерияМин, МассивРез[0].МинимальноеЗначение);
					Диаграмма.УстановитьЗначение(Точка, СерияМакс, МассивРез[0].МаксимальноеЗначение);
					ПоследнийИндексММ = ТаблицаМинМакс.Индекс(МассивРез[0]);
				Иначе
					Если ТаблицаМинМакс.Количество() > (ПоследнийИндексММ + 1) 
						И ТаблицаМинМакс.Получить(ПоследнийИндексММ + 1).ПараметрHTML = СтрТаблица.Параметр
					Тогда
						СтрокаМинМаксТекущая = ТаблицаМинМакс.Получить(ПоследнийИндексММ);
						СтрокаМинМаксСледующая = ТаблицаМинМакс.Получить(ПоследнийИндексММ + 1);
						Если НеделяБеременности < СтрокаМинМаксТекущая.СрокВНеделях Тогда
							ЗначениеТочкиМин = СтрокаМинМаксТекущая.МинимальноеЗначение;
							ЗначениеТочкиМах = СтрокаМинМаксТекущая.МаксимальноеЗначение;
						ИначеЕсли НеделяБеременности > СтрокаМинМаксСледующая.СрокВНеделях Тогда
							ЗначениеТочкиМин = СтрокаМинМаксСледующая.МинимальноеЗначение;
							ЗначениеТочкиМах = СтрокаМинМаксСледующая.МаксимальноеЗначение;
						Иначе
							ЗначениеТочкиМин = СтрокаМинМаксТекущая.МинимальноеЗначение
										  + (СтрокаМинМаксСледующая.МинимальноеЗначение - СтрокаМинМаксТекущая.МинимальноеЗначение) 
										  * (НеделяБеременности - СтрокаМинМаксТекущая.СрокВНеделях) /(СтрокаМинМаксСледующая.СрокВНеделях - СтрокаМинМаксТекущая.СрокВНеделях);
							ЗначениеТочкиМах = СтрокаМинМаксТекущая.МаксимальноеЗначение
										  + (СтрокаМинМаксСледующая.МаксимальноеЗначение - СтрокаМинМаксТекущая.МаксимальноеЗначение) 
										  * (НеделяБеременности - СтрокаМинМаксТекущая.СрокВНеделях) /(СтрокаМинМаксСледующая.СрокВНеделях - СтрокаМинМаксТекущая.СрокВНеделях);
						КонецЕсли;
						Диаграмма.УстановитьЗначение(Точка, СерияМин, ЗначениеТочкиМин);
						Диаграмма.УстановитьЗначение(Точка, СерияМакс, ЗначениеТочкиМах);
					Иначе
						Диаграмма.УстановитьЗначение(Точка, СерияМин, ТаблицаМинМакс.Получить(ПоследнийИндексММ).МинимальноеЗначение);
						Диаграмма.УстановитьЗначение(Точка, СерияМакс, ТаблицаМинМакс.Получить(ПоследнийИндексММ).МаксимальноеЗначение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
			
			ПрошлыйПараметр = СтрТаблица.Параметр;
			
			ОбластьТаблица = Макет.ПолучитьОбласть("Таблица");
			Для нед = 1 По 40 Цикл
				МассивРез = Таблица.НайтиСтроки(Новый Структура("Параметр, Неделя", СтрТаблица.Параметр, нед));
				Если МассивРез.Количество() <> 0 Тогда
					ОбластьТаблица.Параметры["Н"+ нед] = МассивРез[0].Значение;
				Иначе
					ОбластьТаблица.Параметры["Н"+ нед] = "-";
				КонецЕсли;
			КонецЦикла;
			ОбластиНаВывод = Новый Массив();
			ОбластиНаВывод.Добавить(ОбластьДиаграмма);
			ОбластиНаВывод.Добавить(ОбластьТаблица);
			Умещается = ТабДокГравидограммы.ПроверитьВывод(ОбластиНаВывод);
			Если Умещается Тогда
				ТабДокГравидограммы.Вывести(ОбластьДиаграмма);
				ТабДокГравидограммы.Вывести(ОбластьТаблица);
			Иначе
				ТабДокГравидограммы.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокГравидограммы.Вывести(ОбластьШапка);
				ТабДокГравидограммы.Вывести(ОбластьДиаграмма);
				ТабДокГравидограммы.Вывести(ОбластьТаблица);
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТабДокПлан(ТабДокПлан)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ТабДокПлан);
	Возврат ТабДок;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТабДокГравидограммы(ТабДокГравидограммы)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ТабДокГравидограммы);
	Возврат ТабДок;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТабДокПланГравидограммы(ТабДокПлан, ТабДокГравидограммы)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ТабДокПлан);
	ТабДок.Вывести(ТабДокГравидограммы);
	Возврат ТабДок;
КонецФункции

#КонецОбласти
